#Generated by Fabric Compiler ( version 2020.3 <build 62942> ) at Sun Oct 10 00:08:15 2021

set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram
synthesize -ads -selected_syn_tool_opt 2 
remove_constraint  -logic -fdc "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/git_riscv_complete/git_riscv.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
add_constraint "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/git_riscv_complete/git_riscv.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.14/source/perips/pwm.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_netlist 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module pwm
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module pwm
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "C:/Users/20161/Desktop/my_riscv_soc_10.16/source/perips/ax_pwm.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
remove_design -force -verilog "C:/Users/20161/Desktop/my_riscv_soc_10.16/source/perips/ax_pwm.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "C:/Users/Misaka/Desktop/FPGA_nanjing/my_riscv_soc_10.23/source/Desktop/key_filter.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/bcd_8421.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/data_conv.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/DHT22_driver.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/HEX8.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/OLED_drive.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/top_module.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/rtl/uart_tx.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/uart/hc05_top.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/uart/uart_rx.v"
add_design "E:/My_Document/WSJ_Master/Competition/FPGA_Design_Conpetition/my_PDS_code/my_riscv_soc_10.24/source/uart/uart_tx.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
add_simulation "G:/FPGA_Competition/my_riscv_soc_sim_11.11/source/soc_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
dev_map -detail -devmap_remove_dups 1 
